---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetNumberOfBars
source: html/e48e7c02-53e1-f222-26a3-a80c5f97c9cd.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetNumberOfBars Method

Returns the number of bars currently in the rebar.

## Syntax (C#)
```csharp
public int GetNumberOfBars()
```

## Returns
Returns the number of bars currently in the rebar.